app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("username", "email", "password_digest", "created_at", "updated_at", "image_file_name", "image_content_type", "image_file_size", "image_updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)